package by.it.seledtsova.jd01_02;
/*
В классе TaskC(пакет by.it.familiya.jd01_02) один раз введите с консоли nчерез объект типа Scanner -размерность
матрицы arr[n] [n]и вызовите из метода mainстатические методыstep1 step2 step3 с указанной сигнатурой:
1.Задать значения элементов матрицы в интервале значений от -nдо nс помощью генератора случайных чисел.
Числа целые. Тип int. Пока в матрице нет чисел nи -nгенерацию следует повторять, иначе вывести матрицу в консоль,
 а затем, вернуть полученную матрицу. Сигнатураint[ ][ ] step1(intn).
2.Найти, вывести и вернуть сумму элементов исходнойматрицыarr, расположенных между первым и вторымположительными
 элементами каждой строки.Сигнатураintstep2(int[ ][ ] arr).
3.Найти максимальный элемент(ы) в матрице и удалить из исходнойматрицы всестроки и столбцы, его содержащие.
Вывести в консоль и вернуть полученную матрицу. Сигнатураint[ ][ ] step3(int[ ][ ] arr).
 */

import java.util.Arrays;

public class TaskC {}
