package by.it.dudko.jd01_09;

public class FromBottomToTop {
    /*

    * Вывести результат операции на калькуляторе
      на устройство вывода (консоль).
      При выводе объекта Var вызовется его метод toString.
      Cпособов вывода может быть несколько,
      поэтому вызывать метод печати `print` будем
      на экземпляре класса `Printer`.
      Добавить проверку на `не null`.

    * Распарсить строку пользовательского ввода
      на операнды и операцию.

      Реализовать класс Parser, применяющий к строке
      шаблоны регулярных выражений.
      Мапировать пользовательскую операцию с
      соответствующим реализованным методом класса Var
      и вернуть результат операции над экземплярами класса Var.
      Для последнего реализовать утилитарный класс
      с фабрикой Var-ов разных классов-наследников.

    * Запросить пользовательский ввод операции для вычисления
      Cпособов ввода так же может быть несколько.
      В классе ConsoleRunner использовать Scanner.
      Это будет точкой входа программу. Здесь создаем
      необходимые объекты и вызываем методы.

    */
}
